---
kind: method
id: M:Autodesk.Revit.DB.Lighting.LightType.GetLightShape
source: html/0686aa9f-7b29-3d3c-b17f-926c96750cde.htm
---
# Autodesk.Revit.DB.Lighting.LightType.GetLightShape Method

Return a copy of an object derived from LightShape

## Syntax (C#)
```csharp
public LightShape GetLightShape()
```